 
isna().any().any() return bool [See if there is any null value in our data-set]
isna().sum().sum() return total count how many missing values in data-set

In [62]:
import pandas as pd
import numpy as np
df = pd.read_csv('property data.csv')
df.head()
#df.tail()
df = df.replace(r'^\s+$', np.nan, regex=True) #replace whitspace cuz, empty cell consider as white space
#df.isna().any()
#df['ratting'].isnull()
df.isna().sum()
df.tail()

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH SQ_FT
4          NaN   203.0    BERKELEY            Y           3.0        2  1600
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950
7  100008000.0   213.0   TREMONT@@            Y           1.0        1   NaN
8  100009000.0   215.0   TREMONT%&            Y           NaN        2  1800

Find out relateive missing values in dataset by columns

In [63]:
df.isna().sum()/len(df)*100

PID             11.111111
ST_NUM          22.222222
ST_NAME          0.000000
OWN_OCCUPIED    11.111111
NUM_BEDROOMS    33.333333
NUM_BATH        11.111111
SQ_FT           11.111111
dtype: float64

by chance if more then one coloum have missing value then get name of that columns

In [64]:
df.loc[:,df.isnull().any()].columns

Index(['PID', 'ST_NUM', 'OWN_OCCUPIED', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

In [65]:
df['PID'].fillna(0,inplace=True)
df['ST_NUM'].fillna('150',inplace=True)
df['OWN_OCCUPIED'].fillna('DUMMY',inplace=True)
df['NUM_BEDROOMS'].fillna('3',inplace=True)
df['SQ_FT'].fillna('150',inplace=True)
df['NUM_BATH'].fillna('2',inplace=True)

In [66]:
df.isna().sum()/len(df)*100

PID             0.0
ST_NUM          0.0
ST_NAME         0.0
OWN_OCCUPIED    0.0
NUM_BEDROOMS    0.0
NUM_BATH        0.0
SQ_FT           0.0
dtype: float64

In [67]:
def remove_special_characters(dataframe):
    no_special_characters = dataframe.replace(r'[^A-Za-z0-9 ]+', '', regex=True)
    return no_special_characters

In [68]:
remove_special_characters(dataframe=df)

           PID ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0    104      PUTNAM            Y            3        1  1000
1  100002000.0    197   LEXINGTON            N            3       15
2  100003000.0    150   LEXINGTON            N            3        1   850
3  100004000.0    201    BERKELEY            N            1        2   700
4          0.0    203    BERKELEY            Y            3        2  1600
5  100006000.0    207    BERKELEY            Y            3        1   800
6  100007000.0    150  WASHINGTON        DUMMY            2   HURLEY   950
7  100008000.0    213     TREMONT            Y            1        1   150
8  100009000.0    215     TREMONT            Y            3        2  1800